public class TestSimhash {
    public static void main(String[] args) {
        Simhash s = new Simhash();
        String result = s.compare("故人西辞黄鹤楼 ，唱跳Rap打篮球 。春风又绿江南岸 ，练习长达两年半。 清明时节雨坤坤，路上行人梳中分 ，借问背带何处有，牧童遥指我ikun。长江后浪推前浪，爱坤啥样我啥样。鸡冠头背带裤，我是ikun你记住。向阳花木易为春，听说你爱cxk。小黑子树枝666，蒸虾头，好丸吗？树枝赶人，蒸五鱼，食不食油饼，我家鸽鸽在胎上拿姜拿到手软，他那么努力，这样叫我怎么荔枝？已经橘爆你了，再这样我就抱紧了，劝你苏珊，不然我们ikun就紫砂了。", "小黑子苏珊，食不食油饼？耗丸吗？再黑紫砂吧！4年前的梗你们还在玩，4年前的剩饭你们怎么不吃？臻果粉！我看你们都馍蒸了！蒸梅油酥汁！你们犯法了知道吗？你们再这样我就煲胫了！香精煎鱼食不食？香翅捞饭食不食？真没有荚饺！荔枝？你要我怎么荔枝？蒸乌鱼......葡心腩蒸虾头。");
        System.out.println(result);
    }
}
